/* Strings for the alert dialogs displayed to notify the user about connection errors. */


/* GenericStreamError Title */
"GenericStreamError_Title" = "Connection Error";

/* GenericStreamError Message */
"GenericStreamError_Msg" = "An unknown connection error has occurred.";


/* StreamConflict Title */
"StreamConflict_Title" = "Connection was overridden by another client!";

/* StreamConflict Message */
"StreamConflict_Msg" = "The server closed the connection because another client has just connected using the same account settings. Please choose different Location names if you want to be able to connect to the same account using several different clients at the same time. Go to the \"Accounts\" pane in the Preferences window to choose a different name for this Location.";


/* ConnectionTimeout Title */
"ConnectionTimeout_Title" = "Connection Timeout";

/* ConnectionTimeout Message */
"ConnectionTimeout_Msg" = "The attempt to connect to the server has timed out.";


/* InternalServerError Title */
"InternalServerError_Title" = "Internal Server Error";

/* InternalServerError Message */
"InternalServerError_Msg" = "An internal server error has occurred.";


/* SystemShutdown Title */
"SystemShutdown_Title" = "Server Shutdown";

/* SystemShutdown Message */
"SystemShutdown_Msg" = "You will be disconnected because the server is being shut down.";


/* ConnectionRefused Title */
"ConnectionRefused_Title" = "Connection Refused";

/* ConnectionRefused Message */
"ConnectionRefused_Msg" = "The connection was refused by the server.";


/* HostNotFound Title */
"HostNotFound_Title" = "Host Not Found";

/* HostNotFound Message */
"HostNotFound_Msg" = "The hostname of the server for your Jabber account was not found.";


/* ProxyConnectionError Title */
"ProxyConnectionError_Title" = "Proxy Connection Error";

/* ProxyConnectionError Message */
"ProxyConnectionError_Msg" = "An error occurred while trying to connect to the proxy server.";


/* ProxyAuthenticationError Title */
"ProxyAuthenticationError_Title" = "Proxy Authentication Error";

/* ProxyAuthenticationError Message */
"ProxyAuthenticationError_Msg" = "An authentication error occurred while trying to connect to the proxy server. Please verify your proxy settings.";


/* UnknownHost Title */
"UnknownHost_Title" = "Unknown Host";

/* UnknownHost Message */
"UnknownHost_Msg" = "The hostname of the server for your Jabber account is unknown.";


/* NegotiationError Title */
"NegotiationError_Title" = "Protocol Negotiation Error";

/* NegotiationError Message */
"NegotiationError_Msg" = "An error occurred while trying to negotiate a Jabber connection with the server.";


/* TLSError Title */
"TLSError_Title" = "TLS Error";

/* TLSError Message */
"TLSError_Msg" = "An error in the security layer of the connection to the server has occurred.";


/* AuthenticationError Title */
"AuthenticationError_Title" = "Authentication Error";

/* AuthenticationError Message */
"AuthenticationError_Msg" = "Your authentication credentials were not accepted by the server. Please verify that you have entered your Jabber ID and your password correctly. You can change these settings in the \"Accounts\" pane of the application preferences.";


/* TemporaryAuthenticationFailure Title */
"TemporaryAuthenticationFailure_Title" = "Temporary Authentication Failure";

/* TemporaryAuthenticationFailure Message */
"TemporaryAuthenticationFailure_Msg" = "Your authentication credentials were not accepted due to a temporary failure in the server. Please try to connect again later.";


/* SecurityLayerError Title */
"SecurityLayerError_Title" = "Security Layer Error";

/* SecurityLayerError Message */
"SecurityLayerError_Msg" = "An error in the security layer of the connection to the server has occurred.";


/* ResourceBindingError Title */
"ResourceBindingError_Title" = "Resource Binding Error";

/* ResourceBindingError Message */
"ResourceBindingError_Msg" = "An error occurred while setting the Location (resource) name for your connection.";


/* ConnectionClosed Title */
"ConnectionClosed_Title" = "Connection Closed";

/* ConnectionClosed Message */
"ConnectionClosed_Msg" = "The connection was closed unexpectedly by the server.";


/* NoJabberIDError Title */
"NoJabberIDError_Title" = "No Jabber ID Specified";

/* NoJabberIDError Message */
"NoJabberIDError_Msg" = "Please provide a Jabber ID for this account using the Accounts pane in the application Preferences window.";

